JONOKR/ESP32/main/main.c
    switch (DB_PARAM_RADIO_MODE) {
        case DB_WIFI_MODE_AP:
        case DB_WIFI_MODE_AP_LR:
            db_init_wifi_apmode(DB_PARAM_RADIO_MODE);
            break;
        case DB_WIFI_MODE_ESPNOW_AIR:
        case DB_WIFI_MODE_ESPNOW_GND:
            db_init_wifi_espnow();
            db_start_espnow_module();
            break;
        case DB_BLUETOOTH_MODE:
#ifdef CONFIG_BT_ENABLED
            db_init_wifi_apmode(DB_WIFI_MODE_AP);   // WiFi & BLE co-existence to enable webinterface
            db_ble_queue_init();
            db_ble_init();
#else
            DB_RADIO_MODE_DESIGNATED = DB_WIFI_MODE_AP;
            DB_PARAM_RADIO_MODE = DB_WIFI_MODE_AP;
            ESP_LOGE(TAG, "Bluetooth is not enabled with this build. Please enable it in menuconfig and re-compile. Switching to AP mode.");
            db_init_wifi_apmode(DB_WIFI_MODE_AP);
#endif
            break;
        default:
            // Wi-Fi client mode with LR mode enabled
            if (db_init_wifi_clientmode() < 0) {
                ESP_LOGE(TAG, "Failed to init Wifi Client Mode");
            }
            break;
    }

    if (DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
        DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
        // no need to start these services - won`t be available anyway - safe the resources
        start_mdns_service();
        netbiosns_init();
        netbiosns_set_name("dronebridge");
    }
    ESP_ERROR_CHECK(init_fs());
    db_start_control_module();

    db_timer_start_mavlink_heartbeat();
    db_timer_start_mavlink_radio_status();
    db_timer_start_mavlink_fleet_list();
    db_timer_start_status_led();

    if (DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_AIR && DB_PARAM_RADIO_MODE != DB_WIFI_MODE_ESPNOW_GND &&
        DB_PARAM_RADIO_MODE != DB_WIFI_MODE_AP_LR) {
        // no need to start these services - won`t be available anyway - safe the resources
        ESP_ERROR_CHECK(start_rest_server(CONFIG_WEB_MOUNT_POINT));
        ESP_LOGI(TAG, "Rest Server started");
        // Disable legacy support for DroneBridge communication module - no use case for DroneBridge for ESP32
        // communication_module();
    }
    ESP_LOGI(TAG, "app_main finished initial setup");
}
